-- phpMyAdmin SQL Dump
-- version 5.2.1deb1+deb12u1
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Sep 28, 2025 at 06:54 AM
-- Server version: 10.11.14-MariaDB-0+deb12u2
-- PHP Version: 8.3.25

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `qaads`
--

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `name_ar` varchar(255) DEFAULT NULL,
  `description` text DEFAULT NULL,
  `description_ar` text DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  `is_active` tinyint(1) NOT NULL DEFAULT 1,
  `sort_order` int(11) NOT NULL DEFAULT 0,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`id`, `name`, `name_ar`, `description`, `description_ar`, `image`, `is_active`, `sort_order`, `created_at`, `updated_at`) VALUES
(1, 'هدايا دعائية', 'هدايا دعائية', 'نقدم لك مجموعة متنوعة من الهدايا الدعائية عالية الجودة، بتصاميم عصرية مخصصة تعزز حضورك وتبقي علامتك التجارية في ذاكرة عملائك', 'نقدم لك مجموعة متنوعة من الهدايا الدعائية عالية الجودة، بتصاميم عصرية مخصصة تعزز حضورك وتبقي علامتك التجارية في ذاكرة عملائك', 'storage/categories/1758452372_WhatsApp Image 2025-09-04 at 8.53.29 AM.jpeg', 1, 1, '2025-09-19 21:25:13', '2025-09-21 15:39:53'),
(2, 'مطاعم ـ بيتزا ـ شاورما ـ كافيهات', 'مطاعم ـ بيتزا ـ شاورما', 'حوّل منتجك إلى علامة مميزة مع تصاميم مبتكرة ومواد مطبوعة بجودة عالية – من قوائم الطعام إلى التغليف اجذب عملاءك بهوية بصرية تعكس نكهتك وتترك انطباعًا لا يُنسى', 'حوّل منتجك إلى علامة مميزة مع تصاميم مبتكرة ومواد مطبوعة بجودة عالية – من قوائم الطعام إلى التغليف  اجذب عملاءك بهوية بصرية تعكس نكهتك وتترك انطباعًا لا يُنسى', 'storage/categories/1758453007_منتجات.png', 1, 2, '2025-09-19 21:25:13', '2025-09-21 15:47:08'),
(3, 'مناسبات الوطنية والعالمية في السعودية', 'مناسبات الوطنية والعالمية في السعودية', 'احتفل بالمناسبات الوطنية والعالمية بلمسة إبداعية', 'احتفل بالمناسبات الوطنية والعالمية بلمسة إبداعية', 'storage/categories/1758453499_مناسبات الوطنية والعالمية في السعودية.jpg', 1, 1, '2025-09-19 21:25:13', '2025-09-21 15:44:41'),
(4, 'القطاع الصحي', 'القطاع الصحي', 'نقدم خدمات التصميم والطباعة بجودة عالية ومعايير احترافية، لتلبية احتياجات الجهات الحكومية في المطبوعات الرسمية، الهدايا التذكارية، والمواد التعريفية بأسلوب يعكس الهوية المؤسسية ويواكب التطور الرقمي', 'نقدم خدمات التصميم والطباعة بجودة عالية ومعايير احترافية، لتلبية احتياجات الجهات الحكومية في المطبوعات الرسمية، الهدايا التذكارية، والمواد التعريفية بأسلوب يعكس الهوية المؤسسية ويواكب التطور الرقمي', NULL, 1, 4, '2025-09-19 21:25:14', '2025-09-22 08:34:24'),
(5, 'القطاع التعليمي', 'القطاع التعليمي', 'اجعل كل مادة تعليمية وفعالية مدرسية تنبض بالإبداع والجودة.\"', 'اجعل كل مادة تعليمية وفعالية مدرسية تنبض بالإبداع والجودة.\"', NULL, 1, 5, '2025-09-19 21:25:14', '2025-09-21 15:51:57'),
(7, 'تنظيم المؤتمرات والفعاليات', 'تنظيم المؤتمرات والفعاليات', 'نمنحك الحل الأمثل لتنظيم المؤتمرات والفعاليات باحترافية، من التخطيط وحتى التنفيذ', 'نمنحك الحل الأمثل لتنظيم المؤتمرات والفعاليات باحترافية، من التخطيط وحتى التنفيذ', 'storage/categories/1758452251_بوث (1).jpg', 1, 1, '2025-09-21 14:54:53', '2025-09-21 15:34:26'),
(8, 'المتاجر الالكترونية', 'المتاجر الالكترونية', 'اجعل متجرك الإلكتروني يتألق بتصاميم وطباعة مبتكرة – قدّم لعملائك تجربة تسوق لا تُنسى', 'اجعل متجرك الإلكتروني يتألق بتصاميم وطباعة مبتكرة – قدّم لعملائك تجربة تسوق لا تُنسى', NULL, 1, 6, '2025-09-21 15:54:03', '2025-09-22 08:36:30'),
(9, 'دعاية واعلان', 'دعاية واعلان', 'قدم حلول مبتكرة في التصميم والطباعة لتلبية احتياجات الجهات الحكومية والشركات الخاصة، بهوية متفردة وجودة عالية تعكس احترافية علامتك.', 'قدم حلول مبتكرة في التصميم والطباعة لتلبية احتياجات الجهات الحكومية والشركات الخاصة، بهوية متفردة وجودة عالية تعكس احترافية علامتك.', NULL, 1, 7, '2025-09-22 08:36:07', '2025-09-22 14:26:34'),
(10, 'منتجات خاصة', 'منتجات خاصة', 'منصتنا الإلكترونية المتخصصة في التصميم والطباعة تقدم لك منتجات مخصصة بجودة عالية، تعكس هويتك وتمنحك تجربة استثنائية في إبراز علامتك بأسلوب مبتكر', 'منصتنا الإلكترونية المتخصصة في التصميم والطباعة تقدم لك منتجات مخصصة بجودة عالية، تعكس هويتك وتمنحك تجربة استثنائية في إبراز علامتك بأسلوب مبتكر', NULL, 1, 0, '2025-09-22 08:38:49', '2025-09-22 09:08:45'),
(11, 'اكريلك', 'اكريلك', 'اكريلك', 'اكريلك', NULL, 1, 10, '2025-09-22 14:29:52', '2025-09-22 14:29:52');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `categories`
--
ALTER TABLE `categories`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
